# Задача№2 Найдите сумму цифр трехзначного числа. 123 -> 6 (1 + 2 + 3)
#n = 1
#m = 2
#b = 3
#print(n+m+b)

print("введите первое число: ")
a = int(input())
b = int(input("введите второе число: "))
c = int(input("введите третье число: "))
print(a, b, c,'->', a + b + c)